Repository: wp-plugins/summy
Catalog: trunk/lang/summy-*.po
Languages: el

source: Text is empty.
el: Εισάγετε κείμενο.

source: Select a valid language.
el: Επιλέξτε μια από τις γλώσσες.

source: Select a valid position score method.
el: Επιλέξτε έναν από τους αλγορίθμους βαθμολόγησης θέσης.

source: Enter a valid output rate between 1-99.
el: Εισάγετε ένα έγκυρο ποσοστό εξόδου 1-99.

source: Excerpt generation failed for some reason.
el: Η δημιουργία περίληψης απέτυχε για άγνωστο λόγο.

source: WP-Summy requires PHP version 5.3 or greater.
el: WP-Summy χρειάζεται PHP έκδοση 5.3 ή νεότερη.

source: Summy: Excerpt Extraction
el: Summy: Εξαγωγή Αποσπάσματος

source: English
el: Αγγλικά

source: Greek
el: Ελληνικά

source: News Articles
el: Άρθρα

source: Laguage
el: Γλώσσα

source: Output Rate
el: Ποσοστό εξόδου

source: Words Limit
el: Όρια λέξεων

source: The sentences that exceed the word limits will be ingored. 0 disables the limit.
el: Οι προτάσεις με αριθμό λέξεων εκτός των ορίων θα αγνοηθούν. Το 0 απενεργοποιεί το όριο.

source: Terms Score Method
el: Βαθμολογία Όρων

source: Term Frequency Inverse Sentence Frequency, rewards the less used words in sentences.
el: TF: Συχνότητα Όρου ISF: Αντίστροφη Συχνότητα Προτάσεων, επιβραβεύει τους όρους με χαμηλή συχνότητα στις προτάσεις.

source: Position Score Method
el: Βαθμολογία θέσης

source: The News Articles method ranks higher top paragraphs/sentence.
el: Η μέθοδος "Άρθρα" βαθμολογεί υψηλότερα τις αρχικές παραγράφους/προτάσεις.

source: The Baxendale's method ranks higher the first and last sentences in a paragraph.
el: Η μέθοδος του The Baxendale βαθμολογεί υψηλότερα την πρώτη και τελευταία πρόταση κάθε παραγράφου.

source: Score Weights
el: Βάρη Βαθμολογιών

source: Sentence(i) Score = TW * T(i) + PW * P(i) + KW * K(i).
el: Βαθμολογία Πρότασης(ι) = TW * T(i) + PW * P(i) + KW * K(i).

source: The T, P, K are each sentence's terms score, position score and keywords score from title.
el: Οι μεταβλητές T, P, K είναι οι βαθμολογίες όρων, θέσης και τίτλου αντίστοιχα.

source: The TW, PW, KW are the scores weights.
el: Οι μεταβλητές TW, PW, KW είναι τα βάρη των βαθμολογιών.

source: The weights are unsigned float values, set a weight to 0 to disable it.
el: Τα βάρη πέρουν δεκαδικούς αριθμούς, για να απενεργοποίηση αφήστε τα 0.

source: Summarize
el: Περίληψη
